<?php
/**
 * @file
 * 
 */


$page = new stdClass();
$page->disabled = FALSE; /* Edit this to true to make a default page disabled initially */
$page->api_version = 1;
$page->name = 'home_page';
$page->task = 'page';
$page->admin_title = 'Home Page';
$page->admin_description = '';
$page->path = 'home';
$page->access = array();
$page->menu = array();
$page->arguments = array();
$page->conf = array(
  'admin_paths' => FALSE,
);
$page->default_handlers = array();
$handler = new stdClass();
$handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
$handler->api_version = 1;
$handler->name = 'page_home_page_panel_context';
$handler->task = 'page';
$handler->subtask = 'home_page';
$handler->handler = 'panel_context';
$handler->weight = 0;
$handler->conf = array(
  'title' => 'Panel',
  'no_blocks' => 1,
  'pipeline' => 'standard',
  'body_classes_to_remove' => '',
  'body_classes_to_add' => '',
  'css_id' => '',
  'css' => '',
  'contexts' => array(),
  'relationships' => array(),
);
$display = new panels_display();
$display->layout = 'mondrian';
$display->layout_settings = array();
$display->panel_settings = array(
  'style_settings' => array(
    'default' => NULL,
    'main' => NULL,
    'secondary' => NULL,
    'tertiary-first' => NULL,
    'tertiary-second' => NULL,
    'tertiary-third' => NULL,
  ),
);
$display->cache = array();
$display->title = '<none>';
$display->uuid = '1d287d50-31d3-4f36-9f2f-ef4e92f81aef';
$display->content = array();
$display->panels = array();

  $pane = new stdClass();
  $pane->pid = 'new-69846c1f-f0fd-49b8-99e7-3ef28167f026';
  $pane->panel = 'main';
  $pane->type = 'views';
  $pane->subtype = 'news';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '1',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '',
    'url' => '',
    'display' => 'news_block_primary',
    'override_title' => 1,
    'override_title_text' => '<none>',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '69846c1f-f0fd-49b8-99e7-3ef28167f026';
  $display->content['new-69846c1f-f0fd-49b8-99e7-3ef28167f026'] = $pane;
  $display->panels['main'][0] = 'new-69846c1f-f0fd-49b8-99e7-3ef28167f026';
  $pane = new stdClass();
  $pane->pid = 'new-483c8138-7cb5-4437-9a51-af49d355f182';
  $pane->panel = 'main';
  $pane->type = 'views';
  $pane->subtype = 'news';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '1',
    'pager_id' => '0',
    'offset' => '1',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '',
    'url' => '',
    'display' => 'news_block_secondary',
    'override_title' => 1,
    'override_title_text' => '<none>',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '483c8138-7cb5-4437-9a51-af49d355f182';
  $display->content['new-483c8138-7cb5-4437-9a51-af49d355f182'] = $pane;
  $display->panels['main'][1] = 'new-483c8138-7cb5-4437-9a51-af49d355f182';
  $pane = new stdClass();
  $pane->pid = 'new-c5c7c0f4-9660-4a8a-8091-fc3bfe5f299d';
  $pane->panel = 'main';
  $pane->type = 'views';
  $pane->subtype = 'news';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '2',
    'pager_id' => '0',
    'offset' => '2',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '',
    'url' => '',
    'display' => 'news_block_tertiary',
    'override_title' => 1,
    'override_title_text' => '<none>',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = 'c5c7c0f4-9660-4a8a-8091-fc3bfe5f299d';
  $display->content['new-c5c7c0f4-9660-4a8a-8091-fc3bfe5f299d'] = $pane;
  $display->panels['main'][2] = 'new-c5c7c0f4-9660-4a8a-8091-fc3bfe5f299d';
  $pane = new stdClass();
  $pane->pid = 'new-e2c37469-448c-4786-8cfc-1dacd01e330f';
  $pane->panel = 'main';
  $pane->type = 'views';
  $pane->subtype = 'news';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '12',
    'pager_id' => '0',
    'offset' => '4',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '',
    'url' => '',
    'display' => 'news_block_therest',
    'override_title' => 1,
    'override_title_text' => '<none>',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = 'e2c37469-448c-4786-8cfc-1dacd01e330f';
  $display->content['new-e2c37469-448c-4786-8cfc-1dacd01e330f'] = $pane;
  $display->panels['main'][3] = 'new-e2c37469-448c-4786-8cfc-1dacd01e330f';
  $pane = new stdClass();
  $pane->pid = 'new-aa358cfb-f904-48d4-83fa-4fbe32b9ce28';
  $pane->panel = 'main';
  $pane->type = 'views';
  $pane->subtype = 'further';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '1',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '',
    'url' => '',
    'display' => 'block',
    'override_title' => 1,
    'override_title_text' => 'Further...',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = 'aa358cfb-f904-48d4-83fa-4fbe32b9ce28';
  $display->content['new-aa358cfb-f904-48d4-83fa-4fbe32b9ce28'] = $pane;
  $display->panels['main'][4] = 'new-aa358cfb-f904-48d4-83fa-4fbe32b9ce28';
  $pane = new stdClass();
  $pane->pid = 'new-3abe1c11-5dda-4f7a-a14f-7d0a05bc63a3';
  $pane->panel = 'main';
  $pane->type = 'views';
  $pane->subtype = 'newswire';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '3',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '',
    'url' => '',
    'display' => 'block',
    'override_title' => 1,
    'override_title_text' => 'Progressive Newswire',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 5;
  $pane->locks = array();
  $pane->uuid = '3abe1c11-5dda-4f7a-a14f-7d0a05bc63a3';
  $display->content['new-3abe1c11-5dda-4f7a-a14f-7d0a05bc63a3'] = $pane;
  $display->panels['main'][5] = 'new-3abe1c11-5dda-4f7a-a14f-7d0a05bc63a3';
  $pane = new stdClass();
  $pane->pid = 'new-4ad8f894-a79e-4514-b901-f94971dab86f';
  $pane->panel = 'secondary';
  $pane->type = 'views';
  $pane->subtype = 'special_coverage';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '5',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '',
    'url' => '',
    'display' => 'block',
    'override_title' => 0,
    'override_title_text' => '',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '4ad8f894-a79e-4514-b901-f94971dab86f';
  $display->content['new-4ad8f894-a79e-4514-b901-f94971dab86f'] = $pane;
  $display->panels['secondary'][0] = 'new-4ad8f894-a79e-4514-b901-f94971dab86f';
  $pane = new stdClass();
  $pane->pid = 'new-586a3581-218d-4a5c-a28d-7ee4956cb412';
  $pane->panel = 'secondary';
  $pane->type = 'block';
  $pane->subtype = 'block-1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 0,
    'override_title_text' => 'Email Sign-Up',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '586a3581-218d-4a5c-a28d-7ee4956cb412';
  $display->content['new-586a3581-218d-4a5c-a28d-7ee4956cb412'] = $pane;
  $display->panels['secondary'][1] = 'new-586a3581-218d-4a5c-a28d-7ee4956cb412';
  $pane = new stdClass();
  $pane->pid = 'new-62efe002-28c5-4865-a2bc-efa984ce1447';
  $pane->panel = 'secondary';
  $pane->type = 'block';
  $pane->subtype = 'block-2';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 0,
    'override_title_text' => 'Follow Us',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = '62efe002-28c5-4865-a2bc-efa984ce1447';
  $display->content['new-62efe002-28c5-4865-a2bc-efa984ce1447'] = $pane;
  $display->panels['secondary'][2] = 'new-62efe002-28c5-4865-a2bc-efa984ce1447';
  $pane = new stdClass();
  $pane->pid = 'new-f24e3130-efba-4c62-b900-f3e4427cc31a';
  $pane->panel = 'secondary';
  $pane->type = 'views';
  $pane->subtype = 'views_articles';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 1,
    'nodes_per_page' => '20',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '',
    'url' => '',
    'display' => 'block',
    'override_title' => 0,
    'override_title_text' => '',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = 'f24e3130-efba-4c62-b900-f3e4427cc31a';
  
$display->content['new-f24e3130-efba-4c62-b900-f3e4427cc31a'] = $pane;
$display->panels['secondary'][3] = 'new-f24e3130-efba-4c62-b900-f3e4427cc31a';
$display->hide_title = PANELS_TITLE_FIXED;
$display->title_pane = '0';
$handler->conf['display'] = $display;
$page->default_handlers[$handler->name] = $handler;
$pages['home_page'] = $page;
