<?php

$handler = new stdClass();
$handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
$handler->api_version = 1;
$handler->name = 'term_view_panel_context_2';
$handler->task = 'term_view';
$handler->subtask = '';
$handler->handler = 'panel_context';
$handler->weight = 1;
$handler->conf = array(
    'title' => 'Tags',
    'no_blocks' => 1,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => '',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'access' => array(
      'plugins' => array(
        0 => array(
          'name' => 'term_vocabulary',
          'settings' => array(
            'machine_name' => array(
              'topic' => 'topic',
            ),
          ),
          'context' => 'argument_term_1',
          'not' => FALSE,
        ),
      ),
      'logic' => 'and',
    ),
  );
  $display = new panels_display();
  $display->layout = 'mondrian';
  $display->layout_settings = array();
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'main' => NULL,
      'secondary' => NULL,
      'tertiary-first' => NULL,
      'tertiary-second' => NULL,
      'tertiary-third' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = '%term:name';
  $display->uuid = 'f64dd511-4aa8-44f3-9a79-051812ff2468';
  $display->content = array();
  $display->panels = array();
    $pane = new stdClass();
    $pane->pid = 'new-08a57811-918a-47af-8985-a160a6360531';
    $pane->panel = 'main';
    $pane->type = 'views';
    $pane->subtype = 'categorized_news';
    $pane->shown = TRUE;
    $pane->access = array();
    $pane->configuration = array(
      'override_pager_settings' => 0,
      'use_pager' => 0,
      'nodes_per_page' => '1',
      'pager_id' => '0',
      'offset' => '0',
      'more_link' => 0,
      'feed_icons' => 0,
      'panel_args' => 0,
      'link_to_view' => 0,
      'args' => '',
      'url' => '',
      'display' => 'categorized_news_primary',
      'context' => array(
        0 => 'argument_term_1.tid',
      ),
      'override_title' => 1,
      'override_title_text' => '',
    );
    $pane->cache = array();
    $pane->style = array(
      'settings' => NULL,
    );
    $pane->css = array();
    $pane->extras = array();
    $pane->position = 0;
    $pane->locks = array();
    $pane->uuid = '08a57811-918a-47af-8985-a160a6360531';
    $display->content['new-08a57811-918a-47af-8985-a160a6360531'] = $pane;
    $display->panels['main'][0] = 'new-08a57811-918a-47af-8985-a160a6360531';
    $pane = new stdClass();
    $pane->pid = 'new-dffa6c1e-2c04-479f-a84d-4223654f37bb';
    $pane->panel = 'main';
    $pane->type = 'views';
    $pane->subtype = 'categorized_news';
    $pane->shown = TRUE;
    $pane->access = array();
    $pane->configuration = array(
      'override_pager_settings' => 0,
      'use_pager' => 0,
      'nodes_per_page' => '1',
      'pager_id' => '0',
      'offset' => '1',
      'more_link' => 0,
      'feed_icons' => 0,
      'panel_args' => 0,
      'link_to_view' => 0,
      'args' => '',
      'url' => '',
      'display' => 'categorized_news_secondary',
      'context' => array(
        0 => 'argument_term_1.tid',
      ),
      'override_title' => 1,
      'override_title_text' => '',
    );
    $pane->cache = array();
    $pane->style = array(
      'settings' => NULL,
    );
    $pane->css = array();
    $pane->extras = array();
    $pane->position = 1;
    $pane->locks = array();
    $pane->uuid = 'dffa6c1e-2c04-479f-a84d-4223654f37bb';
    $display->content['new-dffa6c1e-2c04-479f-a84d-4223654f37bb'] = $pane;
    $display->panels['main'][1] = 'new-dffa6c1e-2c04-479f-a84d-4223654f37bb';
    $pane = new stdClass();
    $pane->pid = 'new-c8256f5e-5116-4171-8a7d-9889942d0555';
    $pane->panel = 'main';
    $pane->type = 'views';
    $pane->subtype = 'categorized_news';
    $pane->shown = TRUE;
    $pane->access = array();
    $pane->configuration = array(
      'override_pager_settings' => 0,
      'use_pager' => 0,
      'nodes_per_page' => '2',
      'pager_id' => '0',
      'offset' => '2',
      'more_link' => 0,
      'feed_icons' => 0,
      'panel_args' => 0,
      'link_to_view' => 0,
      'args' => '',
      'url' => '',
      'display' => 'categorized_news_tertiary',
      'context' => array(
        0 => 'argument_term_1.tid',
      ),
      'override_title' => 1,
      'override_title_text' => '',
    );
    $pane->cache = array();
    $pane->style = array(
      'settings' => NULL,
    );
    $pane->css = array();
    $pane->extras = array();
    $pane->position = 2;
    $pane->locks = array();
    $pane->uuid = 'c8256f5e-5116-4171-8a7d-9889942d0555';
    $display->content['new-c8256f5e-5116-4171-8a7d-9889942d0555'] = $pane;
    $display->panels['main'][2] = 'new-c8256f5e-5116-4171-8a7d-9889942d0555';
    $pane = new stdClass();
    $pane->pid = 'new-8dacc7b2-0fb7-4e8f-bbc6-70c6392a0c72';
    $pane->panel = 'main';
    $pane->type = 'views';
    $pane->subtype = 'categorized_news';
    $pane->shown = TRUE;
    $pane->access = array();
    $pane->configuration = array(
      'override_pager_settings' => 0,
      'use_pager' => 0,
      'nodes_per_page' => '12',
      'pager_id' => '0',
      'offset' => '4',
      'more_link' => 0,
      'feed_icons' => 0,
      'panel_args' => 0,
      'link_to_view' => 0,
      'args' => '',
      'url' => '',
      'display' => 'categorized_news_remaining',
      'context' => array(
        0 => 'argument_term_1.tid',
      ),
      'override_title' => 1,
      'override_title_text' => '',
    );
    $pane->cache = array();
    $pane->style = array(
      'settings' => NULL,
    );
    $pane->css = array();
    $pane->extras = array();
    $pane->position = 3;
    $pane->locks = array();
    $pane->uuid = '8dacc7b2-0fb7-4e8f-bbc6-70c6392a0c72';
    $display->content['new-8dacc7b2-0fb7-4e8f-bbc6-70c6392a0c72'] = $pane;
    $display->panels['main'][3] = 'new-8dacc7b2-0fb7-4e8f-bbc6-70c6392a0c72';
    $pane = new stdClass();
    $pane->pid = 'new-9c5daa87-7d86-4435-9e29-95be2bf5681b';
    $pane->panel = 'main';
    $pane->type = 'views';
    $pane->subtype = 'further';
    $pane->shown = TRUE;
    $pane->access = array();
    $pane->configuration = array(
      'override_pager_settings' => 0,
      'use_pager' => 0,
      'nodes_per_page' => '1',
      'pager_id' => '0',
      'offset' => '0',
      'more_link' => 0,
      'feed_icons' => 0,
      'panel_args' => 0,
      'link_to_view' => 0,
      'args' => '',
      'url' => '',
      'display' => 'block_1',
      'context' => array(
        0 => 'argument_term_1.tid',
      ),
      'override_title' => 0,
      'override_title_text' => '',
    );
    $pane->cache = array();
    $pane->style = array(
      'settings' => NULL,
    );
    $pane->css = array();
    $pane->extras = array();
    $pane->position = 4;
    $pane->locks = array();
    $pane->uuid = '9c5daa87-7d86-4435-9e29-95be2bf5681b';
    $display->content['new-9c5daa87-7d86-4435-9e29-95be2bf5681b'] = $pane;
    $display->panels['main'][4] = 'new-9c5daa87-7d86-4435-9e29-95be2bf5681b';
    $pane = new stdClass();
    $pane->pid = 'new-b1aa27f4-44c1-4898-b1ae-472e6891bcd8';
    $pane->panel = 'main';
    $pane->type = 'views';
    $pane->subtype = 'newswire';
    $pane->shown = TRUE;
    $pane->access = array();
    $pane->configuration = array(
      'override_pager_settings' => 0,
      'use_pager' => 0,
      'nodes_per_page' => '3',
      'pager_id' => '0',
      'offset' => '0',
      'more_link' => 0,
      'feed_icons' => 0,
      'panel_args' => 0,
      'link_to_view' => 0,
      'args' => '',
      'url' => '',
      'display' => 'block_1',
      'context' => array(
        0 => 'argument_term_1.tid',
      ),
      'override_title' => 0,
      'override_title_text' => '',
    );
    $pane->cache = array();
    $pane->style = array(
      'settings' => NULL,
    );
    $pane->css = array();
    $pane->extras = array();
    $pane->position = 5;
    $pane->locks = array();
    $pane->uuid = 'b1aa27f4-44c1-4898-b1ae-472e6891bcd8';
    $display->content['new-b1aa27f4-44c1-4898-b1ae-472e6891bcd8'] = $pane;
    $display->panels['main'][5] = 'new-b1aa27f4-44c1-4898-b1ae-472e6891bcd8';
    $pane = new stdClass();
    $pane->pid = 'new-1b3b11b9-00a7-4240-a0c9-0de3d304e89b';
    $pane->panel = 'secondary';
    $pane->type = 'block';
    $pane->subtype = 'block-1';
    $pane->shown = TRUE;
    $pane->access = array();
    $pane->configuration = array(
      'override_title' => 0,
      'override_title_text' => 'Sign-up for Newsletter',
    );
    $pane->cache = array();
    $pane->style = array(
      'settings' => NULL,
    );
    $pane->css = array();
    $pane->extras = array();
    $pane->position = 0;
    $pane->locks = array();
    $pane->uuid = '1b3b11b9-00a7-4240-a0c9-0de3d304e89b';
    $display->content['new-1b3b11b9-00a7-4240-a0c9-0de3d304e89b'] = $pane;
    $display->panels['secondary'][0] = 'new-1b3b11b9-00a7-4240-a0c9-0de3d304e89b';
    $pane = new stdClass();
    $pane->pid = 'new-3f19c29b-c7de-4773-a93b-5ad1f06cd5a3';
    $pane->panel = 'secondary';
    $pane->type = 'block';
    $pane->subtype = 'block-2';
    $pane->shown = TRUE;
    $pane->access = array();
    $pane->configuration = array(
      'override_title' => 1,
      'override_title_text' => '<none>',
    );
    $pane->cache = array();
    $pane->style = array(
      'settings' => NULL,
    );
    $pane->css = array();
    $pane->extras = array();
    $pane->position = 1;
    $pane->locks = array();
    $pane->uuid = '3f19c29b-c7de-4773-a93b-5ad1f06cd5a3';
    $display->content['new-3f19c29b-c7de-4773-a93b-5ad1f06cd5a3'] = $pane;
    $display->panels['secondary'][1] = 'new-3f19c29b-c7de-4773-a93b-5ad1f06cd5a3';
    $pane = new stdClass();
    $pane->pid = 'new-e2680e0b-71e7-4088-ae0e-e0ae2fa206f4';
    $pane->panel = 'secondary';
    $pane->type = 'views';
    $pane->subtype = 'most_popular';
    $pane->shown = TRUE;
    $pane->access = array();
    $pane->configuration = array(
      'override_pager_settings' => 0,
      'use_pager' => 0,
      'nodes_per_page' => '3',
      'pager_id' => '0',
      'offset' => '0',
      'more_link' => 0,
      'feed_icons' => 0,
      'panel_args' => 0,
      'link_to_view' => 0,
      'args' => '',
      'url' => '',
      'display' => 'block_most_popular',
      'override_title' => 0,
      'override_title_text' => '',
    );
    $pane->cache = array();
    $pane->style = array(
      'settings' => NULL,
    );
    $pane->css = array();
    $pane->extras = array();
    $pane->position = 2;
    $pane->locks = array();
    $pane->uuid = 'e2680e0b-71e7-4088-ae0e-e0ae2fa206f4';
    $display->content['new-e2680e0b-71e7-4088-ae0e-e0ae2fa206f4'] = $pane;
    $display->panels['secondary'][2] = 'new-e2680e0b-71e7-4088-ae0e-e0ae2fa206f4';
    $pane = new stdClass();
    $pane->pid = 'new-858a5a3c-5e10-4ebc-b3f9-6c05721b4bee';
    $pane->panel = 'secondary';
    $pane->type = 'views';
    $pane->subtype = 'views_articles';
    $pane->shown = TRUE;
    $pane->access = array();
    $pane->configuration = array(
      'override_pager_settings' => 0,
      'use_pager' => 0,
      'nodes_per_page' => '0',
      'pager_id' => '0',
      'offset' => '0',
      'more_link' => 0,
      'feed_icons' => 0,
      'panel_args' => 0,
      'link_to_view' => 0,
      'args' => '',
      'url' => '',
      'display' => 'attachment_1',
      'context' => array(
        0 => 'argument_term_1.tid',
      ),
      'override_title' => 1,
      'override_title_text' => 'Views',
    );
    $pane->cache = array();
    $pane->style = array(
      'settings' => NULL,
    );
    $pane->css = array();
    $pane->extras = array();
    $pane->position = 3;
    $pane->locks = array();
    $pane->uuid = '858a5a3c-5e10-4ebc-b3f9-6c05721b4bee';
    $display->content['new-858a5a3c-5e10-4ebc-b3f9-6c05721b4bee'] = $pane;
    $display->panels['secondary'][3] = 'new-858a5a3c-5e10-4ebc-b3f9-6c05721b4bee';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $handlers['term_view_panel_context_2'] = $handler;